# Step 1: Connect to the local db where Pagila is loaded

In [4]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [44]:
import psycopg2

In [46]:
DB_ENDPOINT = 'localhost'
DB = 'pagila'
DB_USER = 'postgres'
DB_PASSWWORD = 'uncle1dee'
DB_PORT = '5432'

conn_string = 'postgresql://{}:{}@{}:{}/{}'.format(DB_USER, DB_PASSWWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)

postgresql://postgres:uncle1dee@localhost:5432/pagila

In [47]:
%sql $conn_string

'Connected: postgres@pagila'

In [48]:
nStore = %sql select count(*) from store;
nFilms = %sql select count(*) from film;
nCustomers = %sql select count(*) from customer;
nRentals = %sql select count(*) from rental;
nPayment = %sql select count(*) from payment;
nStaff = %sql select count(*) from staff;
nCity = %sql select count(*) from city;
nCountry = %sql select count(*) from country;

print('nFilms\t\t=', nFilms[0][0])
print('nStore\t\t=', nStore[0][0])
print('nRentals\t\t=', nRentals[0][0])
print('nCustomers\t\t=', nCustomers[0][0])
print('nPayment\t\t=', nPayment[0][0])
print('nStaff\t\t=', nStaff[0][0])
print('nCity\t\t=', nCity[0][0])
print('nCountry\t\t=', nCountry[0][0])

 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.
nFilms		= 1000
nStore		= 2
nRentals		= 16044
nCustomers		= 599
nPayment		= 14596
nStaff		= 2
nCity		= 600
nCountry		= 109

### When? What time period are we talking about?

In [53]:
%%sql
select min(payment_date) as start, max(payment_date) as end from payment;

 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.

[(datetime.datetime(2007, 2, 14, 21, 21, 59, 996577), datetime.datetime(2007, 5, 14, 13, 44, 29, 996577))]

### Where? Where do events in this db occur?

In [54]:
%%sql
select district, sum(city_id) as n
from address
group by district
order by n desc
limit 10;

 * postgresql://postgres:***@localhost:5432/pagila
10 rows affected.

[('Shandong', 3237),
 ('England', 2974),
 ('So Paulo', 2952),
 ('West Bengali', 2623),
 ('Buenos Aires', 2572),
 ('Uttar Pradesh', 2462),
 ('California', 2444),
 ('Southern Tagalog', 1931),
 ('Tamil Nadu', 1807),
 ('Hubei', 1790)]

# Step 3: Perform some somple data analysis

## 3.1 Insight 1: Top Grossing Movies

`payment -> rental -> inventory -> film`


### 3.1.1 Films

In [56]:
%%sql
select film_id, title, release_year, rental_rate, rating from film limit 5

 * postgresql://postgres:***@localhost:5432/pagila
5 rows affected.

[(133, 'Chamber Italian', 2006, Decimal('4.99'), 'NC-17'),
 (384, 'Grosse Wonderful', 2006, Decimal('4.99'), 'R'),
 (8, 'Airport Pollock', 2006, Decimal('4.99'), 'R'),
 (98, 'Bright Encounters', 2006, Decimal('4.99'), 'PG-13'),
 (1, 'Academy Dinosaur', 2006, Decimal('0.99'), 'PG')]

### 3.1.2 Payments

In [57]:
%%sql
select * from payment limit 5;

 * postgresql://postgres:***@localhost:5432/pagila
5 rows affected.

[(17503, 341, 2, 1520, Decimal('7.99'), datetime.datetime(2007, 2, 15, 22, 25, 46, 996577)),
 (17504, 341, 1, 1778, Decimal('1.99'), datetime.datetime(2007, 2, 16, 17, 23, 14, 996577)),
 (17505, 341, 1, 1849, Decimal('7.99'), datetime.datetime(2007, 2, 16, 22, 41, 45, 996577)),
 (17506, 341, 2, 2829, Decimal('2.99'), datetime.datetime(2007, 2, 19, 19, 39, 56, 996577)),
 (17507, 341, 2, 3130, Decimal('7.99'), datetime.datetime(2007, 2, 20, 17, 31, 48, 996577))]

### 3.1.3 Inventory

In [58]:
%%sql
select * from inventory limit 5;

 * postgresql://postgres:***@localhost:5432/pagila
5 rows affected.

[(1, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17)),
 (2, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17)),
 (3, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17)),
 (4, 1, 1, datetime.datetime(2006, 2, 15, 10, 9, 17)),
 (5, 1, 2, datetime.datetime(2006, 2, 15, 10, 9, 17))]

### 3.1.4 Get the movie of every payment

In [61]:
%%sql 
SELECT f.title, p.amount, p.payment_date, p.customer_id
FROM payment p
join rental r on (p.rental_id =r.rental_id)
JOIN inventory i on (r.inventory_id = i.inventory_id)
JOIN film f ON (i.film_id = f.film_id)
limit 5;

 * postgresql://postgres:***@localhost:5432/pagila
5 rows affected.

[('Academy Dinosaur', Decimal('0.99'), datetime.datetime(2007, 4, 8, 17, 31, 41, 996577), 431),
 ('Academy Dinosaur', Decimal('3.99'), datetime.datetime(2007, 3, 2, 18, 41, 36, 996577), 518),
 ('Academy Dinosaur', Decimal('3.99'), datetime.datetime(2007, 3, 21, 19, 56, 9, 996577), 279),
 ('Academy Dinosaur', Decimal('0.99'), datetime.datetime(2007, 2, 17, 18, 52, 26, 996577), 170),
 ('Academy Dinosaur', Decimal('0.99'), datetime.datetime(2007, 4, 7, 9, 9, 57, 996577), 161)]

### 3.1.5 Sum movie rental revenue

In [65]:
%%sql

SELECT f.title, sum(p.amount) as revenue
FROM payment as p
join rental r on (p.rental_id = r.rental_id)
JOIN inventory i on (r.inventory_id = i.inventory_id)
JOIN film f ON (i.film_id = f.film_id)
GROUP BY title
order by revenue desc
limit 10;

 * postgresql://postgres:***@localhost:5432/pagila
10 rows affected.

[('Telegraph Voyage', Decimal('215.75')),
 ('Zorro Ark', Decimal('199.72')),
 ('Wife Turn', Decimal('198.73')),
 ('Innocent Usual', Decimal('191.74')),
 ('Hustler Party', Decimal('190.78')),
 ('Saturday Lambs', Decimal('190.74')),
 ('Titans Jerk', Decimal('186.73')),
 ('Harry Idaho', Decimal('177.73')),
 ('Torque Bound', Decimal('169.76')),
 ('Dogma Family', Decimal('168.72'))]

## Insight 2: Top grossing cities

* `payment -> customer -> address -> city`

### 3.2.1 Get the city of each payment

In [ ]:
%%sql 
SELECT p.customer_id, p.rental_id, p.amount, ci.city 
FROM payment p
join customer c on (p.customer_id = c.customer_id)
JOIN address a on (c.address_id = c.address_id)
JOIN city ci ON (a.city_id = ci.city_id)
order by payment_date
limit 10;

### 3.2.2 Top grossing cities

In [ ]:
%%sql 
SELECT ci.city, sum(p.amount) as revenue 
FROM payment p
join customer c on (p.customer_id = c.customer_id)
JOIN address a on (c.address_id = c.address_id)
JOIN city ci ON (a.city_id = ci.city_id)
group by ci.city
order by revenue desc
limit 10;

## 3.3 Insight 3: Revenue of a movie by customer city and by month


### 3.3.1 Total revenue by month

In [ ]:
%%sql 
SELECT sum(p.amount) as revenue, EXTRACT(month from p.payment_date) as month
FROM payment 
group by month
order by revenue desc
limit 10;

### 3.3.2 Each movie by customer city and by month (data cube)

In [ ]:
%%sql 
SELECT f.title, p.amount, p.cutomer_id  ci.city, p.payment_date, EXTRACT(month from p.payment_date) as month
FROM payment p
join rental r on (p.rental_id = r.rental_id)
JOIN inventory i on (r.inventory_id = i.inventory_id)
JOIN film f ON (i.film_id = f.film_id)
join customer c on (p.customer_id = c.customer_id)
JOIN address a on (c.address_id = c.address_id)
JOIN city ci ON (a.city_id = ci.city_id)

order by p.payment_date
limit 10;

### 3.3.3 Sum of revenue of each movie by customer city and by month

In [ ]:
%%sql 
SELECT f.title, ci.city, EXTRACT(month from p.payment_date) as month, sum(p.amount) as revenue
FROM payment p
join rental r on (p.rental_id = r.rental_id)
JOIN inventory i on (r.inventory_id = i.inventory_id)
JOIN film f ON (i.film_id = f.film_id)
join customer c on (p.customer_id = c.customer_id)
JOIN address a on (c.address_id = c.address_id)
JOIN city ci ON (a.city_id = ci.city_id)
group by (f.title, ci.city, month)
order by month, revenue desc
limit 10;

## STEP 4: Creating Facts and Dimensions Table

In [ ]:
%%sql
CREATE TABLE dimDate
(
    date_key integer NOT NULL PRIMARY KEY,
    date date NOT NULL,
    year smallint NOT NULL,
    quarter smallint NOT NULL,
    month smallint NOT NULL,
    day smallint NOT NULL,
    week smallint NOT NULL,
    is_weekend boolean
);

CREATE TABLE IF NOT EXISTS dimCustomer
(
    customer_key SERIAL PRIMARY KEY,
    customer_id smallint NOT NULL,
    first_name varchar(45) NOT NULL,
    last_name varchar(45) NOT NULL,
    email     varchar(50),
    address    varchar(45) NOT NULL,
    address2   varchar(50),
    district   varchar(20) NOT NULL,
    city      varchar(45) NOT NULL,
    country     varchar(45) NOT NULL,
    postal_code  varchar(50),
    phone     varchar(20) NOT NULL,
    active smallint NOT NULL,
    create_date timestamp NOT NULL,
    start_date date NOT NULL,
    end_date date NOT null
);

CREATE TABLE dimMovie
(
    movie_key       SERIAL PRIMARY KEY,
    film_id smallint NOT NULL,
    title varchar(225) NOT NULL,
    description text,
    release_year year,
    language      varchar(20) NOT NULL,
    original_language varchar(20),
    rental_duration smallint NOT NULL,
    length smallint NOT NULL,
    rating varchar(5) NOT NULL,
    special_features varchar(60) NOT NULL
);

CREATE TABLE dimStore
(
    store_key      SERIAL PRIMARY KEY,
    store_id       smallint NOT NULL,
    address    varchar(45) NOT NULL,
    address2   varchar(50),
    district   varchar(20) NOT NULL,
    city      varchar(45) NOT NULL,
    country     varchar(45) NOT NULL,
    postal_code  varchar(50),
    manager_first_name varchar(45) NOT NULL,
    manager_last_name varchar(45) NOT NULL,
    start_date date NOT NULL,
    end_date date NOT NULL
);

CREATE TABLE factSales
(
    sales_key SERIAL PRIMARY KEY,
    date_key     INT NOT NULL REFERENCES dimDate(date_key),
    customer_key     INT NOT NULL REFERENCES dimCustomer(customer_key),
    movie_key     INT NOT NULL REFERENCES dimMovie(movie_key),
    store_key     INT NOT NULL REFERENCES dimStore(store_key),
    sales_amount   decimal(5, 2) NOT NULL
);